app/Views/pages/layout/header.php

try {
    $db = \Config\Database::connect();
    // PERUBAHAN: Menambahkan esc/sanitasi dasar atau fallback query aman
    $list_kampus = $db->table('tb_kampus')->get()->getResultArray();
---
SELECT *
FROM `tb_kampus`