app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'superadmin'
AND `password` = '123456'
AND `status` = 'Aktif'
---
    public function process()
    {
        $session = session();
        $db      = \Config\Database::connect();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Pengecekan password secara langsung (tanpa hash)
        $user = $db->table('users')
            ->where('username', $username)
            ->where('password', $password)
            ->where('status', 'Aktif')
            ->get()
            ->getRowArray();