app/Controllers/Home.php

    private function getNavData(): array
    {
        return [
            'navAum'    => $this->aumModel->orderBy('jenis', 'ASC')->orderBy('nama_aum', 'ASC')->findAll(),
            'navKampus' => $this->kampusModel->orderBy('nama_kampus', 'ASC')->findAll(),
        ];
---
SELECT *
FROM `aum`
ORDER BY `jenis` ASC, `nama_aum` ASC
SELECT *
FROM `tb_kampus`
ORDER BY `nama_kampus` ASC

    public function index(): string
    {
        $data = array_merge($this->getNavData(), [
            'title'          => 'Muhammadiyah Sulawesi Barat - PWM Sulawesi Barat',
            'sliders'        => $this->sliderModel->where('status', 'aktif')->orderBy('id', 'DESC')->findAll(),
            'banners'        => $this->bannerModel->where('status', 'aktif')->orderBy('id', 'DESC')->findAll(),
            'berita'         => $this->beritaModel->where('status', 'Publish')->orderBy('tanggal', 'DESC')->findAll(6),
            'opini'          => $this->opiniModel->where('status', 'Publish')->orderBy('tanggal', 'DESC')->findAll(4),
            'refleksi'       => $this->refleksiModel->orderBy('created_at', 'DESC')->findAll(4),

            // Perhitungan Statistik Realtime
            'total_pdm'      => $this->pdmModel->countAllResults(),
            'total_sekolah'  => $this->sekolahModel->countAllResults(),
            'total_majelis'  => $this->majelisModel->where('status', 'aktif')->countAllResults(),
            'total_aum'      => $this->aumModel->countAllResults(),
            'pdm_list'       => $this->pdmModel->orderBy('nama_pdm', 'ASC')->findAll(),
---
SELECT *
FROM `slider`
WHERE `status` = 'aktif'
ORDER BY `id` DESC
SELECT *
FROM `banner`
WHERE `status` = 'aktif'
ORDER BY `id` DESC
SELECT *
FROM `berita`
WHERE `status` = 'Publish'
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT *
FROM `opini`
WHERE `status` = 'Publish'
ORDER BY `tanggal` DESC
 LIMIT 4
SELECT *
FROM `refleksi`
ORDER BY `created_at` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `pdm`
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
SELECT COUNT(*) AS `numrows`
FROM `aum`
SELECT *
FROM `pdm`
ORDER BY `nama_pdm` ASC

    public function berita(): string
    {
        $keyword = $this->request->getGet('q');

        $this->beritaModel->where('status', 'Publish');

        if (!empty($keyword)) {
            $this->beritaModel->groupStart()
                ->like('judul', $keyword)
                ->orLike('isi', $keyword)
                ->orLike('penulis', $keyword)
                ->groupEnd();
        }

        $beritaList = $this->beritaModel->orderBy('tanggal', 'DESC')->findAll();
---
SELECT *
FROM `berita`
WHERE `status` = 'Publish'
ORDER BY `tanggal` DESC

    public function detailKampus($param = null): string
    {
        if (!$param) {
            throw PageNotFoundException::forPageNotFound('Data Kampus tidak ditemukan.');
        }

        $field  = is_numeric($param) ? $this->kampusModel->primaryKey : 'slug';
        $kampus = $this->kampusModel->where($field, $param)->first();
---
SELECT *
FROM `tb_kampus`
WHERE `slug` = 'universitas-muhammadiyah-mamuju'
 LIMIT 1